richlowe/illumos-gate/usr/src/man/man5/nscd.conf.5
'\" te
.\"  Copyright (c) 2004 Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NSCD.CONF 5 "Mar 6, 2017"
.SH NAME
nscd.conf \- name service cache daemon configuration
.SH SYNOPSIS
.LP
.nf
\fB/etc/nscd.conf\fR
.fi

.SH DESCRIPTION
.LP
The \fBnscd.conf\fR file contains the configuration information for
\fBnscd\fR(8). Each line specifies either an \fIattribute\fR and a
\fIvalue\fR, or an \fIattribute\fR, \fIcachename\fR, and a \fIvalue\fR. Fields
are separated either by SPACE or TAB characters. A `\fB#\fR' (number sign)
indicates the beginning of a comment; characters up to the end of the line are
not interpreted by \fBnscd\fR.
.sp
.LP
\fIcachename\fR is represented by \fBhosts\fR, \fBipnodes\fR, \fBpasswd\fR,
\fBgroup\fR, \fBexec_attr\fR, \fBprof_attr\fR, \fBuser_attr\fR, \fBethers\fR,
\fBrpc\fR, \fBprotocols\fR, \fBnetworks\fR, \fBbootparams\fR,
\fBauth_attr\fR, \fBservices\fR, \fBnetmasks\fR, \fBprinters\fR, or
\fBproject\fR.
.sp
.LP
The \fIattribute\fR field supports the following:
.sp
.ne 2
.na
\fB\fBcheck-files\fR \fIcachename value\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables checking the file belonging to the specified
\fIcachename\fR for changes. If enabled (which is the default), changes in the
corresponding file cause the cache to be invalidated within 10 seconds. Can be
disabled if files are never modified for a slight performance boost,
particularly over \fBNFS\fR. \fIvalue\fR may be either \fByes\fR or \fBno\fR.
.RE

.sp
.ne 2
.na
\fB\fBdebug-level\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Sets the debug level desired. \fIvalue\fR may range from \fB0\fR (the default)
to \fB10\fR. Use of this option causes \fBnscd\fR(8) to run in the foreground
and not become a daemon. Note that the output of the debugging command is not
likely to remain the same from release-to-release; scripts should \fInot\fR
rely on its format.
.RE

.sp
.ne 2
.na
\fB\fBenable-cache\fR \fIcachename value\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables the specified cache. \fIvalue\fR may be either \fByes\fR or
\fBno\fR.
.RE

.sp
.ne 2
.na
\fB\fBenable-per-user-lookup\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables the ability of \fBnscd\fR to create a per-user \fBnscd\fR.
A per-user \fBnscd\fR performs per-user lookups and manages the per-user cache.
The per-user lookups might not be possible if the corresponding name service
switch backends do not support it or are not configured to do so. The value of
this attribute can be either \fByes\fR or \fBno\fR.
.RE

.sp
.ne 2
.na
\fB\fBkeep-hot-count\fR \fIcachename value\fR\fR
.ad
.sp .6
.RS 4n
This attribute allows the administrator to set the number of entries
\fBnscd\fR(8) is to keep current in the specified cache. \fIvalue\fR is an
integer number which should approximate the number of entries frequently used
during the day.
.RE

.sp
.ne 2
.na
\fB\fBlogfile\fR \fIdebug-file-name\fR\fR
.ad
.sp .6
.RS 4n
Specifies name of the file to which debug info should be written. Use
\fB/dev/tty\fR for standard output.
.RE

.sp
.ne 2
.na
\fB\fBmaximum-per-user-nscd\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Sets the maximum number of per-user \fBnscd\fRs that can be created and managed
by the main \fBnscd\fR daemon. The value is an integer.
.RE

.sp
.ne 2
.na
\fB\fBnegative-time-to-live\fR \fIcachename value\fR\fR
.ad
.sp .6
.RS 4n
Sets the time-to-live for negative entries (unsuccessful queries) in the
specified cache. \fIvalue\fR is in integer seconds. Can result in significant
performance improvements if there are several files owned by uids (user IDs)
not in system databases; should be kept small to reduce cache coherency
problems.
.RE

.sp
.ne 2
.na
\fB\fBper-user-nscd-time-to-live\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Sets the time-to-live value for a per-user \fBnscd\fR based on the last time
the per-user \fBnscd\fR was active. The value is an integer that specifies a
number of seconds.
.RE

.sp
.ne 2
.na
\fB\fBpositive-time-to-live\fR \fIcachename value\fR\fR
.ad
.sp .6
.RS 4n
Sets the time-to-live for positive entries (successful queries) in the
specified cache. \fIvalue\fR is in integer seconds. Larger values increase
cache hit rates and reduce mean response times, but increase problems with
cache coherence. Note that sites that push (update) NIS maps nightly can set
the value to be the equivalent of 12 hours or more with very good performance
implications.
.RE

.sp
.ne 2
.na
\fB\fBsuggested-size\fR \fIcachename value\fR\fR
.ad
.sp .6
.RS 4n
Sets the suggested number of hash buckets in the specified cache. This
parameter should be changed only if the number of entries in the cache exceeds
the suggested size by more than a factor of four or five. Since this is the
internal hash table size, \fIvalue\fR should remain a prime number for optimum
efficiency.
.sp
This attribute is obsolete and will be silently ignored. \fBnscd\fR now
automatically adjusts the hash table size.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Availibility	SUNWcsu
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.LP
\fBauth_attr\fR(5),
\fBbootparams\fR(5),
\fBethers\fR(5),
\fBexec_attr\fR(5),
\fBgroup\fR(5),
\fBhosts\fR(5),
\fBnetmasks\fR(5),
\fBnetworks\fR(5),
\fBpasswd\fR(5),
\fBprinters\fR(5),
\fBprof_attr\fR(5),
\fBproject\fR(5),
\fBprotocols\fR(5),
\fBrpc\fR(5),
\fBservices\fR(5),
\fBuser_attr\fR(5),
\fBattributes\fR(7),
\fBnscd\fR(8)
