richlowe/illumos-gate/usr/src/man/man8/gssd.8
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH GSSD 8 "Apr 25, 2007"
.SH NAME
gssd \- generates and validates GSS-API tokens for kernel RPC
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/gss/gssd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fB\fR\fBgssd\fR is the user mode daemon that operates between the kernel rpc
and the Generic Security Service Application Program Interface (\fBGSS-API\fR)
to generate and validate \fBGSS-API\fR security tokens. In addition, \fBgssd\fR
maps the \fBGSS-API\fR principal names to the local user and group ids. By
default, all groups that the requested user belongs to will be included in the
grouplist credential. \fBgssd\fR is invoked by the Internet daemon
\fBinetd\fR(8) the first time that the kernel \fBRPC\fR requests \fBGSS-API\fR
services.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 6n
Successful completion.
.RE

.sp
.ne 2
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
\fBkill\fR(1),
\fBpkill\fR(1),
\fBsvcs\fR(1),
\fBgsscred.conf\fR(5),
\fBresolv.conf\fR(5),
\fBattributes\fR(7),
\fBsmf\fR(7),
\fBgsscred\fR(8),
\fBinetadm\fR(8),
\fBinetd\fR(8),
\fBsvcadm\fR(8)
.sp
.LP
\fIRFC 2078\fR
.SH NOTES
.sp
.LP
The following signal has the specified effect when sent to the server process
using the \fBkill\fR(1) command:
.sp
.ne 2
.na
\fB\fBSIGHUP\fR\fR
.ad
.RS 10n
\fBgssd\fR rereads the \fBgsscred.conf\fR(5) options.
.RE

.sp
.LP
When one of the mechanisms being used is Kerberos, then the \fBgssd\fR process
must be restarted after adding or changing the \fBresolv.conf\fR(5) file.
.sp
.LP
The \fBgssd\fR service is managed by the service management facility,
\fBsmf\fR(7), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/gss:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(8). Responsibility for
initiating and restarting this service is delegated to \fBinetd\fR(8). Use
\fBinetadm\fR(8) to make configuration changes and to view configuration
information for this service. The service's status can be queried using the
\fBsvcs\fR(1) command.
