richlowe/illumos-gate/usr/src/man/man8/lpsched.8
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH LPSCHED 8 "Sep 3, 2004"
.SH NAME
lpsched \- start the LP print service
.SH SYNOPSIS
.LP
.nf
\fBlpsched\fR [\fB-f\fR \fInum_filters\fR] [\fB-n\fR \fInum_notifiers\fR] [\fB-p\fR \fIfd_limit\fR]
     [\fB-r\fR \fIreserved_fds\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The  \fBlpsched\fR command  starts or restarts the  \fBLP\fR print service.
.sp
.LP
The  \fBlpshut\fR command stops the  \fBLP\fR print service.  Printers that are
restarted using \fBlpsched\fR reprint (in their entirety) print requests that
were stopped by  \fBlpshut\fR. See  \fBlpshut\fR(8).
.sp
.LP
It is recommended that you start  and stop the LP print service using
\fBsvcadm\fR(8).  See \fBNOTES\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-f\fR\fI num_filters\fR\fR
.ad
.RS 20n
Specifies the number of concurrent slow filters that may be run on a print
server. A default value of \fB1\fR is used if none is specified. Depending on
server configuration, a value of  \fB1\fR may cause printers to remain idle
while there are jobs queued to them.
.RE

.sp
.ne 2
.na
\fB\fB-n\fR\fI num_notifiers\fR\fR
.ad
.RS 20n
Specifies the number of concurrent notification processes that can run on a
print server. A default value of  \fB1\fR is used when none is specified.
.RE

.sp
.ne 2
.na
\fB\fB-p\fR\fI fd_limit\fR\fR
.ad
.RS 20n
Specifies the file descriptor resource limit for the  \fBlpsched\fR process. A
default value of  \fB4096\fR is used if none is specified. On extremely large
and active print servers, it may be necessary to increase this value.
.RE

.sp
.ne 2
.na
\fB\fB-r\fR\fI reserved_fds\fR\fR
.ad
.RS 20n
Specifies the number of file descriptors that the scheduler reserves for
internal communications under heavy load. A default value of  \fB2\fR is used
when none is specified. It should not be necessary to modify this value unless
instructed to do so when troubleshooting problems under high load.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 12n
Successful completion.
.RE

.sp
.ne 2
.na
\fBnon-zero\fR
.ad
.RS 12n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/var/spool/lp/*\fR\fR
.ad
.RS 19n
\fBLP\fR print queue.
.RE

.SH SEE ALSO
.sp
.LP
\fBlp\fR(1),
\fBlpstat\fR(1),
\fBsvcs\fR(1),
\fBattributes\fR(7),
\fBsmf\fR(7),
\fBlpadmin\fR(8),
\fBlpmove\fR(8),
\fBlpshut\fR(8),
\fBsvcadm\fR(8)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
The \fBlpsched\fR service is managed by the service management facility,
\fBsmf\fR(7), under the service identifier:
.sp
.in +2
.nf
svc:/application/print/server
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(8). The service's
status can be queried using the \fBsvcs\fR(1) command.
