richlowe/illumos-gate/usr/src/man/man8/ndmpd.8
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 2014 Nexenta Systems, Inc.  All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing. See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NDMPD 8 "Feb 24, 2014"
.SH NAME
ndmpd \- Network Data Management Protocol daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ndmp/ndmpd\fR [\fB-df\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBndmpd\fR daemon handles client Network Data Management Protocol (NDMP)
requests. NDMP is an open, enterprise-wide, network-based data management
protocol used for backup and recovery. The \fBndmpd\fR daemon enables users to
manage data backup and recovery using Data Management Application (DMA)
clients. The NDMP protocol is used to coordinate data movement and control
between a DMA and an NDMP server or between two NDMP servers.

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-d\fR\fR
.ad
.RS 4n
Enables debugging mode. Overrides ndmpd/debug-mode smf(7) property.
.RE

.sp
.ne 2
.na
\fB\fB-f\fR\fR
.ad
.RS 4n
Tells NDMP server not to detach from terminal and to run in foreground. Log
messages will be printed to standard error output in addition to ndmp log
file.
.RE

.SH EXIT STATUS
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 5n
Successful completion.
.RE

.sp
.ne 2
.na
\fB\fB95\fR\fR
.ad
.RS 5n
An error occurred that prevented the \fBndmpd\fR daemon from initializing, such
as failure to fork a process, mutex initialization.
.RE

.sp
.ne 2
.na
\fB\fB96\fR\fR
.ad
.RS 5n
Configuration problem or invalid command line options.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/usr/lib/ndmp/ndmpd\fR\fR
.ad
.sp .6
.RS 4n
Network data management protocol server binary.
.RE

.sp
.ne 2
.na
\fB\fB/var/log/ndmp/ndmplog.0\fR\fR
.ad
.sp .6
.RS 4n
Network data management protocol log messages file.
.RE

.sp
.ne 2
.na
\fB\fB/var/ndmp/dumpdates\fR\fR
.ad
.sp .6
.RS 4n
A text file that stores information about the date and the level of dump
backups.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1),
\fBattributes\fR(7),
\fBsmf\fR(7),
\fBndmpadm\fR(8),
\fBsvcadm\fR(8),
\fBsvccfg\fR(8),
\fBsyslogd\fR(8)
.SH NOTES
.sp
.LP
The \fBndmpd\fR daemon is managed by the service management facility
(\fBsmf\fR(7)), under the service identifier:
.sp
.in +2
.nf
svc:/system/ndmpd:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(8). The service's
status can be queried using the \fBsvcs\fR(1) command.
