richlowe/illumos-gate/usr/src/man/man8/poold.8
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH POOLD 8 "Dec 1, 2005"
.SH NAME
poold \- automated resource pools partitioning daemon
.SH SYNOPSIS
.LP
.nf
\fBpoold\fR [\fB-l\fR \fIlevel\fR]
.fi

.SH DESCRIPTION
.LP
\fBpoold\fR provides automated resource partitioning facilities. \fBpoold\fR
can be enabled or disabled using the Solaris Service Management Facility,
\fBsmf\fR(7). \fBpoold\fR requires the Resource Pools facility to be active in
order to operate.
.sp
.LP
The dynamic resource pools service's fault management resource identifier
(FMRI) is:
.sp
.in +2
.nf
svc:/system/pools/dynamic
.fi
.in -2

.sp
.LP
The resource pools service's FMRI is:
.sp
.in +2
.nf
svc:/system/pools
.fi
.in -2

.sp
.LP
\fBpoold\fR's configuration details are held in a \fBlibpool\fR(3LIB)
configuration and you can access all customizable behavior from this
configuration.
.sp
.LP
\fBpoold\fR periodically examines the load on the system and decides whether
intervention is required to maintain optimal system performance with respect to
resource consumption. \fBpoold\fR also responds to externally initiated (with
respect to \fBpoold\fR) changes of either resource configuration or objectives.
.sp
.LP
If intervention is required, \fBpoold\fR attempts to reallocate the available
resources to ensure that performance objectives are satisfied. If it is not
possible for \fBpoold\fR to meet performance objectives with the available
resources, then a message is written to the log. \fBpoold\fR allocates scarce
resources according to the objectives configured by the administrator. The
system administrator must determine which resource pools are most deserving of
scarce resource and indicate this through the importance of resource pools and
objectives.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-l\fR \fIlevel\fR\fR
.ad
.RS 12n
Specify the verbosity level for logging information.
.sp
Specify \fIlevel\fR as \fBALERT\fR, \fBCRIT\fR, \fBERR\fR, \fBWARNING\fR,
\fBNOTICE\fR, \fBINFO\fR, and \fBDEBUG\fR. If \fIlevel\fR is not supplied, then
the default logging level is \fBINFO\fR.
.sp
.ne 2
.na
\fB\fBALERT\fR\fR
.ad
.RS 11n
 A condition that should be corrected immediately, such as a corrupted system
database.
.RE

.sp
.ne 2
.na
\fB\fBCRIT\fR\fR
.ad
.RS 11n
Critical conditions, such as hard device errors.
.RE

.sp
.ne 2
.na
\fB\fBERR\fR\fR
.ad
.RS 11n
Errors.
.RE

.sp
.ne 2
.na
\fB\fBWARNING\fR\fR
.ad
.RS 11n
Warning messages.
.RE

.sp
.ne 2
.na
\fB\fBNOTICE\fR\fR
.ad
.RS 11n
 Conditions that are not error conditions, but that may require special
handling.
.RE

.sp
.ne 2
.na
\fB\fBINFO\fR\fR
.ad
.RS 11n
Informational messages.
.RE

.sp
.ne 2
.na
\fB\fBDEBUG\fR\fR
.ad
.RS 11n
Messages that contain information normally of use only when debugging a
program.
.RE

.RE

.sp
.LP
When invoked manually, with the \fB-l\fR option, all log output is directed to
standard error.
.SH EXAMPLES
.LP
\fBExample 1 \fRModifying the Default Logging Level
.sp
.LP
The following command modifies the default logging level to \fBERR\fR:

.sp
.in +2
.nf
# /usr/lib/pool/poold -l ERR
.fi
.in -2
.sp

.LP
\fBExample 2 \fREnabling Dynamic Resource Pools
.sp
.LP
The following command enables dynamic resource pools:

.sp
.in +2
.nf
# /usr/sbin/svcadm enable svc:/system/pools/dynamic
.fi
.in -2
.sp

.SH ATTRIBUTES
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	See below.
.TE

.sp
.LP
The invocation is Evolving. The output is Unstable.
.SH SEE ALSO
.LP
\fBpooladm\fR(8), \fBpoolbind\fR(8), \fBpoolcfg\fR(8), \fBpoolstat\fR(8),
\fBsvcadm\fR(8), \fBpool_set_status\fR(3POOL), \fBlibpool\fR(3LIB),
\fBattributes\fR(7), \fBsmf\fR(7)
.sp
.LP
\fI\fR
