richlowe/illumos-gate/usr/src/man/man8/powerd.8
'\" te
.\"  Copyright (c) 1999, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH POWERD 8 "May 13, 2017"
.SH NAME
powerd \- power manager daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/power/powerd\fR [\fB-n\fR]
.fi

.SH DESCRIPTION
.LP
The \fBpowerd\fR daemon is started by \fBpmconfig\fR(8) to monitor system
activity and perform an automatic shutdown using the suspend-resume feature.
When the system is suspended, complete current state is saved on the disk
before power is removed. On reboot, the system automatically starts a resume
operation and the system is restored to the same state it was in immediately
prior to suspend.
.sp
.LP
Immediately prior to system shutdown, the daemon notifies \fBsyslogd\fR(8) of
the shutdown, which broadcasts a notification.
.SH OPTIONS
.LP
The following option is supported:
.sp
.ne 2
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
No broadcast mode. The daemon silently shuts down the system without notifying
\fBsyslogd\fR(8).
.RE

.SH FILES
.ne 2
.na
\fB\fB/etc/power.conf\fR\fR
.ad
.RS 19n
Power Management configuration information file
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability 	Unstable
.TE

.SH SEE ALSO
.LP
\fBpmconfig\fR(8), \fBsyslogd\fR(8), \fBpower.conf\fR(5),
\fBattributes\fR(7), \fBcpr\fR(4), \fBpm\fR(4D)
.sp
.LP
\fIUsing Power Management\fR
