richlowe/illumos-gate/usr/src/man/man8/rsh.8
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1993, Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH RSH 8 "Nov 1, 1993"
.SH NAME
rsh, restricted_shell \- restricted shell command interpreter
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/rsh\fR [\fB-acefhiknprstuvx\fR] [\fIargument\fR]...
.fi

.SH DESCRIPTION
.LP
\fBrsh\fR is a limiting version of the standard command interpreter \fBsh\fR,
used to restrict logins to execution environments whose capabilities are more
controlled than those of \fBsh\fR (see \fBsh\fR(1) for complete description and
usage).
.sp
.LP
When the shell is invoked, it scans the environment for the value of the
environmental variable, \fBSHELL\fR. If it is found and \fBrsh\fR is the file
name part of its value, the shell becomes a restricted shell.
.sp
.LP
The actions of \fBrsh\fR are identical to those of \fBsh\fR, except that the
following are disallowed:
.RS +4
.TP
.ie t \(bu
.el o
changing directory (see \fBcd\fR(1)),
.RE
.RS +4
.TP
.ie t \(bu
.el o
setting the value of $\fBPATH\fR,
.RE
.RS +4
.TP
.ie t \(bu
.el o
specifying path or command names containing \fB/\fR,
.RE
.RS +4
.TP
.ie t \(bu
.el o
redirecting output (\fB>\fR and \fB>>\fR).
.RE
.sp
.LP
The restrictions above are enforced after \fI\&.profile\fR is interpreted.
.sp
.LP
A restricted shell can be invoked in one of the following ways:
.RS +4
.TP
1.
\fBrsh\fR is the file name part of the last entry in the \fB/etc/passwd\fR
file (see \fBpasswd\fR(5));
.RE
.RS +4
.TP
2.
the environment variable \fBSHELL\fR exists and \fBrsh\fR is the file name
part of its value; the environment variable \fBSHELL\fR needs to be set in the
\fB\&.login\fR file;
.RE
.RS +4
.TP
3.
the shell is invoked and \fBrsh\fR is the file name part of argument 0;
.RE
.RS +4
.TP
4.
the shell is invoked with the \fB-r\fR option.
.RE
.sp
.LP
When a command to be executed is found to be a shell procedure, \fBrsh\fR
invokes \fBsh\fR to execute it. Thus, it is possible to provide to the end-user
shell procedures  that have access to the full power of the standard shell,
while imposing a limited menu of commands; this scheme assumes that the
end-user does not have write and execute permissions in the same directory.
.sp
.LP
The net effect of these rules is that the writer of the \fI\&.profile\fR (see
\fBprofile\fR(5)) has complete control over user actions by performing
guaranteed setup actions and leaving the user in an appropriate directory
(probably \fInot\fR the login directory).
.sp
.LP
The system administrator often sets up a directory of commands (that is,
\fB/usr/rbin\fR) that can be safely invoked by a restricted shell. Some systems
also provide a restricted editor, \fBred\fR.
.SH EXIT STATUS
.LP
Errors detected by the shell, such as syntax errors, cause the shell to return
a non-zero exit status. If the shell is being used non-interactively execution
of the shell file is abandoned. Otherwise, the shell returns the exit status of
the last command executed.
.SH SEE ALSO
.LP
\fBIntro\fR(1), \fBcd\fR(1), \fBlogin\fR(1), \fBrsh\fR(1), \fBsh\fR(1),
\fBexec\fR(2), \fBpasswd\fR(5), \fBprofile\fR(5), \fBattributes\fR(7)
.SH NOTES
.LP
The restricted shell, \fB/usr/lib/rsh\fR, should not be confused with the
remote shell, \fB/usr/bin/rsh\fR, which is documented in \fBrsh\fR(1).
