richlowe/illumos-gate/usr/src/man/man8/ypmake.8
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH YPMAKE 8 "Feb 25, 2017"
.SH NAME
ypmake \- rebuild NIS database
.SH SYNOPSIS
.LP
.nf
\fBcd\fR \fB/var/yp\fR ; \fBmake\fR [\fImap\fR]
.fi

.SH DESCRIPTION
.LP
The file called \fBMakefile\fR in \fB/var/yp\fR is used by \fBmake\fR(1S) to
build the  Network Information Service (\fBNIS\fR) database. With no arguments,
\fBmake\fR creates \fBdbm\fR databases for any \fBNIS\fR maps that are
out-of-date, and then executes \fByppush\fR(8) to notify slave databases that
there has been a change.
.sp
.LP
If you supply a \fImap\fR on the command line, \fBmake\fR will update that map
only. Typing \fBmake passwd\fR will create and \fByppush\fR the password
database (assuming it is out of date). Likewise, \fBmake ipnodes\fR and \fBmake
networks\fR will create and \fByppush\fR the \fBipnodes\fR and \fBnetwork\fR
files, \fB$(INETDIR)/ipnodes\fR and \fB$(DIR)/networks\fR.
.sp
.LP
There are four special variables used by \fBmake\fR: \fBDIR\fR, which gives the
directory of the source files; \fBNOPUSH\fR, which when non-null inhibits doing
a \fByppush\fR of the new database files; \fBINETDIR\fR, which gives the
directory of the \fBipnodes\fR source file; and \fBDOM\fR, which is used to
construct a domain other than the master's default domain. The default for
\fBDIR\fR is \fB/etc\fR, and the default for \fBINETDIR\fR is \fB/etc/inet\fR.
The default for \fBNOPUSH\fR is the null string.
.sp
.LP
Refer to \fBypfiles\fR(5) and \fBypserv\fR(8) for an overview of the
\fBNIS\fR service.
.sp
.LP
If a \fBNIS\fR to LDAP (N2L) configuration file, \fB/var/yp/NISLDAPmapping\fR,
is present, the \fBNIS\fR server components run in N2L mode. In N2L mode, the
server components use a new set of map files with an LDAP-prefix, based on the
LDAP DIT. In N2L mode, authoritative NIS information is obtained from the DIT.
The NIS source files and \fBypmake\fR have no role, and they should not be
used. If \fBypmake\fR is accidentally run, then the server components will
detect this, and will log a warning message. For additional information, see
\fBypfiles\fR(5).
.SH FILES
.ne 2
.na
\fB\fB/var/yp\fR\fR
.ad
.RS 19n
Directory containing  \fBNIS\fR configuration files.
.RE

.sp
.ne 2
.na
\fB\fB/etc/inet/hosts\fR\fR
.ad
.RS 19n
System hosts file.
.RE

.sp
.ne 2
.na
\fB\fB/etc\fR\fR
.ad
.RS 19n
Default directory for source files.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(7)  for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.LP
\fBmake\fR(1S),
\fBypclnt\fR(3NSL),
\fBNISLDAPmapping\fR(5),
\fBypfiles\fR(5),
\fBypserv\fR(5),
\fBmakedbm\fR(8),
\fBypbind\fR(8),
\fByppush\fR(8),
\fBypserv\fR(8)
.SH NOTES
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun Yellow
Pages (\fBYP\fR).  The functionality of the two remains the same. Only the name
has changed. The name Yellow Pages is a registered trademark in the United
Kingdom of British Telecommunications plc, and may not be used without
permission.
