richlowe/illumos-gate/usr/src/man/man4ipp/flowacct.4ipp
'\" te
.\" Copyright (c) 2004, Sun Microsystems Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FLOWACCT 4IPP "Sep 29, 2004"
.SH NAME
flowacct \- Flow Accouting module
.SH DESCRIPTION
.sp
.LP
The flow accounting module \fBflowacct\fR enables you to record flow details.
You use flow details to gather statistics and/or for billing purposes.
Accounting consists of recording flow details in a location you designate and
in a format that you can retrieve at a later stage. IPQoS accounting relies on
the exacct mechanism to store and retrieve flow information.
.sp
.LP
A flow is defined by the 5-tuple - saddr, sport, daddr, dport and protocol.
.sp
.LP
Typically, the accounting module is the last datapath element in a sequence of
actions. Flow attributes include ToS/DS, user id, project id, creation time
(time the flow was created), last seen (when pkts for the flow were last seen),
action name (instance that recorded the flow information), nbytes and npackets.
Attributes are split into groups entitled \fBbasic\fR and \fBextended\fR. The
basic group records only the nbytes, npackets and action name, while the
extended group is a superset of the basic group and records all attributes. The
attributes to be recorded, in addition to the accounting file that contains
flow details, are selected using \fBacctadm\fR(8). The \fBflowacct\fR module
does not provide a mechanism to retrieve flow information from the accounting
file nor to interpret the retrieved information.
.SH STATISTICS
.sp
.LP
The flowacct module exports the following statistics available through kstat:
.sp
.in +2
.nf
module: flowacct                   instance: <action id>
  name: Flowacct statistics        class <action name>
        bytes_in_tbl               <bytes in the flow table>
        epackets                   <packets in error>
        flows_in_tbl               <flow records in the flow table>
        nbytes                     <number of bytes through this instance>
        npackets                   <number of packets>
        usedmem                    <memory, in bytes, used by the flow table>
.fi
.in -2

.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/ipp/sparcv9/flowacct\fR\fR
.ad
.sp .6
.RS 4n
64-bit module (SPARC only.)
.RE

.SH SEE ALSO
.sp
.LP
\fBipqosconf\fR(8), \fBacctadm\fR(8), \fBlibexacct3LIB\fR,
\fBdlcosmk\fR(4IPP), \fBdscpmk\fR(4IPP), \fBipqos\fR(4IPP), \fBipgpc\fR(4IPP),
\fBtokenmt\fR(4IPP), \fBtswtclmt\fR(4IPP)
