richlowe/illumos-gate/usr/src/man/man4d/bbc_beep.4d
'\" te
.\"  Copyright (c) 2001, Sun Microsystems, Inc.
.\"  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH BBC_BEEP 4D "Dec 18, 2001"
.SH NAME
bbc_beep \-  Platform-dependent Beep driver for BBC-based hardware.
.SH SYNOPSIS
.LP
.nf
beep@unit-address
.fi

.SH DESCRIPTION
.sp
.LP
The \fBbbc_beep\fR driver generates beeps on platforms (including Sun Blade
1000) that use BBC-based registers and USB keyboards. When the \fBKIOCCMD\fR
ioctl is issued to the USB keyboard module (see \fBusbkbm\fR(4M)) with command
\fBKBD_CMD_BELL/KBD_CMD_NOBELL\fR, \fBusbkbm\fR(4M) passes the request to the
\fBbbc_beep\fR driver to turn the beep on and off, respectively.
.SH FILES
.sp
.ne 2
.na
\fB\fB/platform/sun4u/kernel/drv/sparcv9/bbc_beep\fR\fR
.ad
.sp .6
.RS 4n
 64-bit ELF kernel driver
.RE

.SH ATTRIBUTES
.sp
.LP
See attributes(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	BBC-based SPARC
.TE

.SH SEE ALSO
.sp
.LP
\fBkbd\fR(1),
\fBgrbeep\fR(4D),
\fBkb\fR(4M),
\fBusbkbm\fR(4M),
\fBattributes\fR(7)
.sp
.LP
\fIWriting Device Drivers\fR
.SH DIAGNOSTICS
.sp
.LP
None
