richlowe/illumos-gate/usr/src/man/man4d/chxge.4d
'\" te
.\"  Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CHXGE 4D "Jan 17, 2005"
.SH NAME
chxge \- Chelsio Ethernet network interface controllers
.SH SYNOPSIS
.LP
.nf
/dev/chxge
.fi

.SH DESCRIPTION
.sp
.LP
The \fBchxge\fR Ethernet driver is a  multi-threaded, loadable, clonable,
STREAMS hardware driver supporting the connectionless Data Link Provider
Interface, \fBdlpi\fR(4P), over Chelsio NIC controllers. Multiple (and  mixed)
NIC controllers installed within the  system are supported  by  the driver. The
\fBchxge\fR driver provides basic support for the NIC hardware. Functions
include chip initialization, frame transmit and receive, and error recovery and
reporting.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning, character-special device \fB/dev/chxge\fR is used to access NIC
devices installed within the system.
.SH CHXGE AND DLPI
.sp
.LP
The \fBchxge\fR driver is dependent on \fB/kernel/misc/gld\fR, a loadable
kernel  module  that  provides the \fBchxge\fR driver with the DLPI and STREAMS
functionality required of a LAN driver. See \fBgld\fR(4D) for more details on
the primitives supported by the driver.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response to
the DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Default Maximum SDU is 1500 (ETHERMTU).
.RE
.RS +4
.TP
.ie t \(bu
.el o
dlsap address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is DL_ETHER.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The sap length value is  -2, meaning  the  physical address component is
followed immediately by a 2-byte sap component within the DLSAP address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address  value is Ethernet/IEEE  broadcast address
(FF:FF:FF:FF:FF:FF).
.RE
.SH FILES
.sp
.ne 2
.na
\fB/dev/chxge\fR
.ad
.RS 29n
Character special device.
.RE

.sp
.ne 2
.na
\fB/kernel/drv/sparcv9/chxge\fR
.ad
.RS 29n
SPARC chxge driver binary.
.RE

.sp
.ne 2
.na
\fB/kernel/drv/chxge\fR
.ad
.RS 29n
x86 platform kernel module. (32-bit).
.RE

.sp
.ne 2
.na
\fB/kernel/drv/amd64/chxge\fR
.ad
.RS 29n
x86 platform kernel module. (64-bit).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
\fBgld\fR(4D),
\fBdlpi\fR(4P),
\fBattributes\fR(7),
\fBnetstat\fR(8),
\fBgld\fR(9F),
\fBgld_mac_info\fR(9S)
