richlowe/illumos-gate/usr/src/man/man4d/uath.4d
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH UATH 4D "Sep 10, 2009"
.SH NAME
uath \- Atheros AR5523 USB IEEE802.11a/b/g Wireless Network Driver
.SH DESCRIPTION
.sp
.LP
The \fBuath\fR IEEE802.11a/b/g wireless network driver is a multi-threaded,
loadable, clonable, GLDv3-based STREAMS driver supporting Atheros AR5523 USB
IEEE802.11a/b/g wireless network driver.
.SS "Configuration"
.sp
.LP
The \fBuath\fR driver performs auto-negotiation to determine the data rate and
mode. The driver supports only BSS networks (also known as \fBap\fR or
\fBinfrastructure\fR networks) and \fBopen\fR (or \fBopen-system\fR) or shared
system authentication. For wireless security, WEP encryption, WPA-PSk, and
WPA2-PSK are currently supported. You can perform configuration and
administration tasks using the \fBdladm\fR(8) and \fBwificonfig\fR(8)
utilities.
.SH FILES
.sp
.ne 2
.na
\fB\fB/dev/uath\fR\fR
.ad
.RS 29n
Special character device
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/uath\fR\fR
.ad
.RS 29n
32-bit ELF 86 kernel module (x86)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/uat\fR\fR
.ad
.RS 29n
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/misc/uathfw\fR\fR
.ad
.RS 29n
32-bit ELF firmware kernel module (x86)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/misc/amd64/uathfw\fR\fR
.ad
.RS 29n
64-bit ELF firmware kernel module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
l | l
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(8), \fBwificonfig\fR(8), \fBattributes\fR(7), \fBdlpi\fR(4P),
\fBgld\fR(4D)
.sp
.LP
\fIIEEE802.11b/g - Wireless LAN Standard - IEEE, 2003\fR
