richlowe/illumos-gate/usr/src/man/man4d/zcons.4d
'\" te
.\"  Copyright 2003 Sun Microsystems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ZCONS 4D "Aug 24, 2003"
.SH NAME
zcons \- Zone console device driver
.SH DESCRIPTION
.sp
.LP
The \fBzcons\fR character driver exports the console for system zones. The
driver is comprised of two "sides:" a master side with which applications in
the global zone communicate, and a slave side, which receives I/O from the
master side. The slave side is available in the global zones.
.sp
.LP
Applications must not depend on the location of \fB/dev\fR or \fB/devices\fR
entries exported by \fBzcons\fR. Inside a zone, the \fBzcons\fR slave  side is
fronted by \fB/dev/console\fR and other console-related  symbolic links, which
are used by applications that expect to write to the system console.
.sp
.LP
The \fBzcons\fR driver is Sun Private, and may change in future releases.
.SH FILES
.sp
.ne 2
.na
\fB\fB/dev/zcons/<\fIzonename\fR>/masterconsole\fR \fR
.ad
.sp .6
.RS 4n
Global zone master side console for zone <\fIzonename\fR>.
.RE

.sp
.ne 2
.na
\fB\fB/dev/zcons/<\fIzonename\fR>/slaveconsole\fR \fR
.ad
.sp .6
.RS 4n
Global zone slave side console for zone <\fIzonename\fR>.
.RE

.sp
.ne 2
.na
\fB\fB/dev/zconsole\fR \fR
.ad
.sp .6
.RS 4n
Non-global zone console (slave side).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
 Interface Stability	Sun Private
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(7),
\fBzones\fR(7),
\fBzoneadm\fR(8),
\fBzonecfg\fR(8)
